app/controllers/songs_controller.rb

  def index
    if params[:artist_id]#if we are accessing all songs via artist routing
      #we want @songs = artist.songs (Accessed via songs routing: .artist_id vs artist.id)
      if @artist = Artist.find_by(id: :artist_id) && @artist != nil
        @songs = Artist.find_by(params[:artist_id]).songs
      else
        flash[:message] = "Artist not found"
        redirect_to artists_path
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "artists".* FROM "artists" WHERE (5) LIMIT 1
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
SELECT "songs".* FROM "songs"